Documents/ИА_ПротоколЕженедельногоСобрания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ИА_ПротоколЕженедельногоСобрания</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>БлагодарностиШтрафы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пост</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОргСхема</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПрисутствиеРуководителей</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Отделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОргСхема</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Присутствует</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ГлавныеСтатистики</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Отделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОргСхема</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидСтатистики</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИА_ВидыСтатистик</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредыдущаяКвота</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекущееЗначениеСтатистики</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Квота</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>БоевойПлан</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Отделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОргСхема</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>План</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИА_ПланыДействий</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Проблемы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Достижения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/ИА_ПланыДействий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ИА_ПланыДействий</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКонца</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пост</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОргСхема</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Утверждено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУтверждения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Утвердил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_Состояния</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ситуация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Шаги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Содержание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокИсполнения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Продукт</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Время</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Выполнено</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШагФормулы</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИА_Состояния</v8:Type>
								<v8:Type>cfg:EnumRef.ИА_ТипыЗадачБП</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ответственный</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОргСхема</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяПлан</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяФакт</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>План</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидСтатистики</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИА_ВидыСтатистик</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Состояние</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИА_Состояния</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КвотаПлан</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекущееЗначениеСтатистики</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредыдущийПлан</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СостояниеЗа3Недели</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИА_Состояния</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика1</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика2</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Аналитика3</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пост</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОргСхема</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/ИА_ПротоколЕженедельногоСобрания/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ЗаполнитьСтатистики(Команда)
	ЗаполнитьСтатистикиСервер();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтатистикиСервер()

	Объект.ГлавныеСтатистики.Очистить();
	
	Для каждого стрОтд из Объект.ПрисутствиеРуководителей Цикл
		постОтд = стрОтд.Отделение;
		
		план = ПолучитьПланОтделения(постОтд);
		
		//
		МассивСтрок = Новый Массив;
		МассивСтрок.Добавить(0);
		ТЗСтат = постОтд.НастройкаСтатистик.Статистики.Выгрузить();
		ТЗСтат.Свернуть("ВидСтатистики");
		
		Для каждого стрСтатистика из ТЗСтат Цикл
			Новстр = Объект.ГлавныеСтатистики.Добавить();
			Новстр.Отделение = постОтд;
			Новстр.ВидСтатистики = стрСтатистика.ВидСтатистики;
			
			Если ЗначениеЗаполнено(план) Тогда
				стрПлан = план.План.Найти(стрСтатистика.ВидСтатистики);
				Если ЗначениеЗаполнено(стрПлан) Тогда
					Новстр.ТекущееЗначениеСтатистики = стрПлан.ТекущееЗначениеСтатистики;			
					Новстр.Квота = стрПлан.КвотаПлан;
					Новстр.ПредыдущаяКвота = стрПлан.ПредыдущийПлан;
				КонецЕсли;
			КонецЕсли;
			
			Прервать;//будет только первый элемент
		КонецЦикла;
		
		Если ТЗСтат.Количество() = 0 Тогда
			Новстр = Объект.ГлавныеСтатистики.Добавить();
			Новстр.Отделение = постОтд;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция ПолучитьПланОтделения(пОтделение)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ИА_ПланыДействий.Ссылка
	               |ИЗ
	               |	Справочник.ИА_ПланыДействий КАК ИА_ПланыДействий
	               |ГДЕ
	               |	ИА_ПланыДействий.Пост = &Пост
	               |	И ИА_ПланыДействий.ПометкаУдаления = ЛОЖЬ
	               |	И ИА_ПланыДействий.Родитель = &Родитель
	               |	И ИА_ПланыДействий.ДатаНачала >= &ДатаНачала
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ИА_ПланыДействий.ДатаНачала УБЫВ";
	Запрос.УстановитьПараметр("Пост", пОтделение);
	Запрос.УстановитьПараметр("ДатаНачала", Объект.Дата - 60*60*24*5);
	Запрос.УстановитьПараметр("Родитель", Справочники.ИА_ПланыДействий.ПустаяСсылка());
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		Возврат Справочники.ИА_ПланыДействий.ПустаяСсылка();
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура ЗаполнитьПланы(Команда)
	ЗаполнитьПланыСервер();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПланыСервер()
	Объект.БоевойПлан.Очистить();
	
	Для каждого стрОтд из Объект.ПрисутствиеРуководителей Цикл
		постОтд = стрОтд.Отделение;
		Новстр = Объект.БоевойПлан.Добавить();
		Новстр.Отделение = постОтд;
		план = ПолучитьПланОтделения(постОтд);
		Новстр.План = план;		
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура БоевойПланПриАктивизацииСтроки(Элемент)
	Если Элементы.БоевойПлан.ТекущаяСтрока = ПредИДСтрокиБП И Элемент <> Неопределено Тогда  // обход глюка 1с с повторным вызовом активизации строки
		возврат;
	КонецЕсли;
	
	тд = Элементы.БоевойПлан.ТекущиеДанные;
	ПредИДСтрокиБП = Элементы.БоевойПлан.ТекущаяСтрока;
	
	ДеревоПлана.ПолучитьЭлементы().Очистить();
	Если тд<>Неопределено и ЗначениеЗаполнено(тд.Отделение) и ЗначениеЗаполнено(тд.План) Тогда
		ЗагрузитьПлан(тд.План);
	КонецЕсли;
	
	ОбновитьИтогиПоШагам();

КонецПроцедуры

Процедура ЗагрузитьПлан(План)	
	ДерРез = РеквизитФормыВЗначение("ДеревоПлана");
	
	ИА_Защита_БП.ПолучитьДеревоПлана(ДерРез, План, План.Состояние);
			
	ЗначениеВРеквизитФормы(ДерРез, "ДеревоПлана");
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция СложитьВремя(в1, в2)
	Если не ЗначениеЗаполнено(в2) Тогда
		возврат в1;
	КонецЕсли;
	
	возврат в1 + (в2 - Дата(1,1,1));
КонецФункции

&НаКлиенте
Процедура ОбновитьИтогиПоШагам()
	ВремяИтого = Дата(1,1,1);
	ВремяИтогоФакт = Дата(1,1,1);
	Для каждого стр из ДеревоПлана.ПолучитьЭлементы() Цикл  // шаги, типы		
		Итог11 = Дата(1,1,1);
		Итог11Ф = Дата(1,1,1);
		Для каждого стр1 из стр.ПолучитьЭлементы() Цикл // задачи
			ВремяИтого = СложитьВремя(ВремяИтого , стр1.ВремяПлан);  
			ВремяИтогоФакт = СложитьВремя(ВремяИтогоФакт , стр1.ВремяФакт);  
			
			Итог11 = СложитьВремя(Итог11 , стр1.ВремяПлан);
			Итог11Ф = СложитьВремя(Итог11Ф , стр1.ВремяФакт);
		КонецЦикла;
		стр.ВремяПлан = ФорматИтога(Итог11);
		стр.ВремяФакт = ФорматИтога(Итог11Ф);
	КонецЦикла;
	
	время = ФорматИтога(ВремяИтого);
	ВремяФакт = ФорматИтога(ВремяИтогоФакт);

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ФорматИтога(д1)
	
	Если д1 = дата(1,1,1) Тогда
		возврат "";
	КонецЕсли;
	
	КолЧасов = (День(д1)-1)*24 + Час(д1);
	возврат формат(КолЧасов,"ЧЦ=2; ЧН=; ЧВН=")+":"+формат(Минута(д1),"ЧЦ=2; ЧН=; ЧВН=");
КонецФункции


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СокрВид = Константы.КСУ_СокращенныйВидПлана.Получить();
	ВидГруппировки = константы.КСУ_ГруппировкаЗадачПлана.Получить();

	Если СокрВид Тогда
		Элементы.ДеревоПланаПродукт.Видимость = ложь;
		Элементы.ДеревоПланаСрокИсполнения.Видимость = ложь;
		Элементы.ДеревоПланаВремяФакт.Видимость = ложь;
		Элементы.ДеревоПланаСодержание.Заголовок = "Задача";
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПредИДСтрокиБП = 10000;
	
КонецПроцедуры

&НаКлиенте
Процедура БоевойПланПриИзменении(Элемент)
	тд = Элементы.БоевойПлан.ТекущиеДанные;
	ПредИДСтрокиБП = Элементы.БоевойПлан.ТекущаяСтрока;
КонецПроцедуры

&НаКлиенте
Процедура Печать(Команда)
	
	
	табД = ПечатьНаСервере();
	табД.Показать();
КонецПроцедуры

&НаСервере
Функция ПечатьНаСервере()
	
	
	ТабДок = Новый ТабличныйДокумент;	
	
	Макет = РеквизитФормыВЗначение("Объект").ПолучитьМакет("Макет");

	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	ОбластьМакета.Параметры.Дата = формат(Объект.Дата, "ДФ=dd.MM.yyyy");
	ТабДок.Вывести(ОбластьМакета);
	
	Для каждого стр из Объект.ПрисутствиеРуководителей Цикл
		ОбластьМакета = Макет.ПолучитьОбласть("Участник");
		ОбластьМакета.Параметры.Участник = стр.Отделение.Наименование;
		ТабДок.Вывести(ОбластьМакета);
	КонецЦикла;
	
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка2");
	ТабДок.Вывести(ОбластьМакета);
	
	Для каждого стр из Объект.ГлавныеСтатистики Цикл
		ОбластьМакета = Макет.ПолучитьОбласть("Статистика");
		ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры,стр);
		ТабДок.Вывести(ОбластьМакета);
	КонецЦикла;
	
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка3");
	ТабДок.Вывести(ОбластьМакета);

	ОбластьМакета = Макет.ПолучитьОбласть("План");
	ТЗЗадачиБП = ВернутьПредставлениеБП();
	Для Каждого Стр Из ТЗЗадачиБП Цикл
		ОбластьМакета.Параметры.Заполнить(Стр);
		ТабДок.Вывести(ОбластьМакета);
	КонецЦикла;
	
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка4");
	ОбластьМакета.Параметры.БлагодарностиШтрафы = Объект.БлагодарностиШтрафы;
	ТабДок.Вывести(ОбластьМакета);

	
	Возврат ТабДок;
		
КонецФункции

&НаСервере
Функция ВернутьПредставлениеБП()
		
	БоевойПланПредыдущий.Очистить();
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИА_ПротоколЕженедельногоСобрания.Ссылка
	|ИЗ
	|	Документ.ИА_ПротоколЕженедельногоСобрания КАК ИА_ПротоколЕженедельногоСобрания
	|ГДЕ
	|	ИА_ПротоколЕженедельногоСобрания.Дата < &ДатаДок
	|	И НЕ ИА_ПротоколЕженедельногоСобрания.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	ИА_ПротоколЕженедельногоСобрания.Дата УБЫВ";
	
	ДатаДок = ?(ЗначениеЗаполнено(Объект.Ссылка),Объект.Дата, ТекущаяДата());
	Запрос.УстановитьПараметр("ДатаДок", ДатаДок);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	БоевойПланПредыдущий.Очистить();
	Если Выборка.Следующий() Тогда
		ЗначениеВРеквизитФормы(Выборка.Ссылка.БоевойПлан.Выгрузить(,"Отделение,План"),"БоевойПланПредыдущий");
	КонецЕсли;

	
	тзПредПланы = РеквизитФормыВЗначение("БоевойПланПредыдущий");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	тзПредПланы.Отделение,
	|	тзПредПланы.План
	|ПОМЕСТИТЬ тзПредПланы
	|ИЗ
	|	&ТЗПред КАК тзПредПланы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	тзТекПланы.Отделение,
	|	тзТекПланы.Проблемы,
	|	тзТекПланы.Достижения,
	|	тзТекПланы.План
	|ПОМЕСТИТЬ тзТекПланы
	|ИЗ
	|	&ТЗТек КАК тзТекПланы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	тзТекПланы.Отделение КАК ОтдСсылка,
	|	тзТекПланы.План КАК ТекПлан,
	|	тзТекПланы.Проблемы,
	|	тзТекПланы.Достижения,
	|	тзПредПланы.План КАК ПредПлан
	|ИЗ
	|	тзТекПланы КАК тзТекПланы
	|		ЛЕВОЕ СОЕДИНЕНИЕ тзПредПланы КАК тзПредПланы
	|		ПО тзТекПланы.Отделение = тзПредПланы.Отделение";
	
	Запрос.УстановитьПараметр("ТЗПред", тзПредПланы);
	Запрос.УстановитьПараметр("ТЗТек", Объект.БоевойПлан.Выгрузить());
	
	Выборка = Запрос.Выполнить().Выбрать();	
	ТЗБП = Новый ТаблицаЗначений;
	ТЗБП.Колонки.Добавить("Отделение");
	ТЗБП.Колонки.Добавить("ПланПрошлый");
	ТЗБП.Колонки.Добавить("План");
	ТЗБП.Колонки.Добавить("Проблемы");
	ТЗБП.Колонки.Добавить("Достижения");
	
	Пока Выборка.Следующий() Цикл
		Новстр = ТЗБП.Добавить();		
		Новстр.Отделение = Выборка.ОтдСсылка.наименование;
		Новстр.Проблемы = Выборка.Проблемы;
		Новстр.Достижения = Выборка.Достижения;
		Если ЗначениеЗаполнено(Выборка.ПредПлан) Тогда
			Новстр.ПланПрошлый = ВернутьЗадачиБП(Выборка.ПредПлан,Истина);
		КонецЕсли;
		Новстр.План = ВернутьЗадачиБП(Выборка.ТекПлан,Ложь);
	КонецЦикла;
	
	Возврат ТЗБП;
КонецФункции

Функция ВернутьЗадачиБП(ПланСсылка, ВыгружатьТолькоВыполненные);
	ЗадачиБП = "";
	Шаги = Справочники.ИА_ЗадачиПлана.Выбрать(,ПланСсылка);
	
	Пока Шаги.Следующий() Цикл
		Если не шаги.ПометкаУдаления Тогда
			Если Шаги.Выполнено ИЛИ не ВыгружатьТолькоВыполненные Тогда
				ЗадачиБП = ЗадачиБП + Шаги.Содержание + "; ";
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Возврат ЗадачиБП;
КонецФункции
